**1.VİDEO**

In [2]:
import pandas as pd
import numpy as np

seri= pd.Series([1,2,3,4,5,6,7,8,9])
print(seri)
type(seri)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

pandas.core.series.Series

In [3]:
#.axes : Serinin start,stop, step değerlerini gösterir.
print(seri.axes)

#dtype(): Serinin veri tipini gösterir.
print(seri.dtype)

# .size: Eleman sayısı?
print(seri.size)

# .ndim: Kaç boyutlu?
print(seri.ndim)

# .values:
print(seri.values)

# .head(adet):  ilk adet kadar elemanı gösterir. Adet yazılmazsa ilk beş adeti verir.
print(seri.head())

# tail(): head in tam tersi
print(seri.tail())

[RangeIndex(start=0, stop=9, step=1)]
int64
9
1
[1 2 3 4 5 6 7 8 9]
0    1
1    2
2    3
3    4
4    5
dtype: int64
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [4]:
seri1= pd.Series([12,34,25,66,86],index=["a","b","c","d","e"])
print(seri1)

a    12
b    34
c    25
d    66
e    86
dtype: int64

In [5]:
print(seri1["a"])
print(seri1[["a","b"]])

12
a    12
b    34
dtype: int64

In [6]:
sözlük={"reg": 10, "log": 11, "cart": 12}
seri2=pd.Series(sözlük)
print(sözlük)
print(seri2)

{'reg': 10, 'log': 11, 'cart': 12}
reg     10
log     11
cart    12
dtype: int64

**2.VİDEO**

In [7]:
l= [1,2,3,4,5]
pd.DataFrame(l,columns= ["değisken_ismi"])

   değisken_ismi
0              1
1              2
2              3
3              4
4              5

In [45]:
m= np.arange(1,10).reshape(3,3)
df=pd.DataFrame(m, columns=["1","2","3"])
df.columns={"var1","var2","var3"}
df

   var3  var1  var2
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

sözlük= {"var1": s1, "var2": s2, "var3": s3}
df=pd.DataFrame(sözlük)
df

   var1  var2  var3
0     3     3     2
1     6     6     6
2     6     0     7
3     0     3     0
4     5     8     8

In [19]:
df.index=["a","b","c","d","e"]
df

   var1  var2  var3
a     3     3     2
b     6     6     6
c     6     0     7
d     0     3     0
e     5     8     8

In [20]:
# .drop(): ile sütun veya satır silebiliriz.
# axis=1 ile ütun siler.
#axis=0 ile satır siler.

df.drop("var2",axis=1)

   var1  var3
a     3     2
b     6     6
c     6     7
d     0     0
e     5     8

In [21]:
df.drop("c",axis=0)

   var1  var2  var3
a     3     3     2
b     6     6     6
d     0     3     0
e     5     8     8

In [13]:
df

   var1  var2  var3
a     8     8     7
b     2     1     7
c     9     9     3
d     7     5     6
e     7     3     4

In [22]:
#inplace parametresi kullanarak değişiklikleri kalıcı hale getirebiliriz.

df.drop("c",axis=0,inplace=True)

In [23]:
df["sum"]= (df["var1"]+df["var2"]+df["var3"]) 
df

#Burada sum yerine ortalama almanın ve bunu mean gibi bi fonksiyonla satır satır yapmanın bir yolu var mı liderlere sor.

   var1  var2  var3  sum
a     3     3     2    8
b     6     6     6   18
d     0     3     0    3
e     5     8     8   21

In [25]:
df.drop("var4",axis=1,inplace=True)
df

KeyError: "['var4'] not found in axis"

**Gözlem ve Değişken Seçimi**

In [26]:
m=np.random.randint(1,50,size=(5,5))
df=pd.DataFrame(m,columns=[ "var1", "var2","var3", "var4","var5"])
df

   var1  var2  var3  var4  var5
0     2    18    12    44    29
1    26     3    31    19    10
2    49    29     7    41    35
3    42    25    30    22     6
4    31    25     3     5    13

In [27]:
# .loc: Tanımlandığı şekliyle seçim yapmak için kullanılır.
df.loc[0:3]

   var1  var2  var3  var4  var5
0     2    18    12    44    29
1    26     3    31    19    10
2    49    29     7    41    35
3    42    25    30    22     6

In [28]:
#iloc:alışık olduğumuz indexleme mantığıyla seçim yapmak için kullanılır.
df.iloc[0:3]

   var1  var2  var3  var4  var5
0     2    18    12    44    29
1    26     3    31    19    10
2    49    29     7    41    35

In [29]:
df.iloc[0,0]

2

In [30]:
df.iloc[:3,:4]

   var1  var2  var3  var4
0     2    18    12    44
1    26     3    31    19
2    49    29     7    41

In [31]:
df[df.var2 >22]

   var1  var2  var3  var4  var5
2    49    29     7    41    35
3    42    25    30    22     6
4    31    25     3     5    13

In [32]:
df.query("var1 > 15 & var3 < 15")

   var1  var2  var3  var4  var5
2    49    29     7    41    35
4    31    25     3     5    13

In [34]:
df2= df + 100
df2

   var1  var2  var3  var4  var5
0   102   118   112   144   129
1   126   103   131   119   110
2   149   129   107   141   135
3   142   125   130   122   106
4   131   125   103   105   113

In [36]:
# .concat(p1,p2): iki dataframe i birleştirir. ignore_index parametresi ile indexleri sıfırlayabiliriz.
pd.concat([df,df2])
# join parametresi ile hangi sütun üzerinde birleştireceğini belirleyebiliriz.

   var1  var2  var3  var4  var5
0     2    18    12    44    29
1    26     3    31    19    10
2    49    29     7    41    35
3    42    25    30    22     6
4    31    25     3     5    13
0   102   118   112   144   129
1   126   103   131   119   110
2   149   129   107   141   135
3   142   125   130   122   106
4   131   125   103   105   113

In [37]:
pd.concat([df,df2],ignore_index=True)

   var1  var2  var3  var4  var5
0     2    18    12    44    29
1    26     3    31    19    10
2    49    29     7    41    35
3    42    25    30    22     6
4    31    25     3     5    13
5   102   118   112   144   129
6   126   103   131   119   110
7   149   129   107   141   135
8   142   125   130   122   106
9   131   125   103   105   113

In [ ]:
# join parametresini ve inner ı anlamadım.

In [47]:
df3=pd.DataFrame({"Çalışanlar" : ["Hasan","Kubilay", "Can", "Görkem"],
                  "Grup": ["Kaptan", "Manager", "Tangocu", "Korfball"]})
df3

  Çalışanlar      Grup
0      Hasan    Kaptan
1    Kubilay   Manager
2        Can   Tangocu
3     Görkem  Korfball

In [48]:
df2=pd.DataFrame({"Çalışanlar": ["Hasan","Kubilay", "Can", "Görkem"],
                  "Sınıf": ["3","2","Hazırlık","1"]})
df2

  Çalışanlar     Sınıf
0      Hasan         3
1    Kubilay         2
2        Can  Hazırlık
3     Görkem         1

In [49]:
# merge(): Birebir birleştirme işlemleri yapabiliriz.
pd.merge(df3,df2)

  Çalışanlar      Grup     Sınıf
0      Hasan    Kaptan         3
1    Kubilay   Manager         2
2        Can   Tangocu  Hazırlık
3     Görkem  Korfball         1

In [51]:
pd.merge(df2,df3,on="Çalışanlar")

  Çalışanlar     Sınıf      Grup
0      Hasan         3    Kaptan
1    Kubilay         2   Manager
2        Can  Hazırlık   Tangocu
3     Görkem         1  Korfball

**3.VİDEO:**
**Toplulaştırma ve Gruplama İşlemleri**

In [53]:
#Dışarıdan veri seti çekip kullanabilmek adına:

import seaborn as sns

# .count(): eleman sayısını
# .first(),last(): ilk ve son elemanı
# .mean(), median(): ortalama ve medyan
# .min(),max(): min ve maximum değeri
# .std(),var(): standart sapma ve varyans
# .sum(): toplam değer

# .describe(): ile bunların hepsini gösteebiliriz.
# .T: tablonun, matrisin "Transpozunu" alır.
# The .dropna(): removes the rows that contains NULL values.

***3.Videonun 7. dakikasından sonrasını zaman kaybetmemek adına not almadan izledim.***

**DIŞARIDAN VERİ OKUMA:**

In [56]:
pd.read_csv("class_grades.csv",sep=";").head

FileNotFoundError: [Errno 2] No such file or directory: 'class_grades.csv'

**Bu dosyayı neden açmadı? Dosya bilgisayarımda mevcut.**

In [57]:
pip install matplotlip

Collecting matplotlip
  Downloading matplotlip-0.2-py3-none-any.whl (1.8 kB)
Installing collected packages: matplotlip
Successfully installed matplotlip-0.2

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: pip3 install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [59]:
import matplotlib.pyplot as plt